#### Author : Balaji Kartheek
### In this Notebook I'll show how to create a DataFrame using Pandas Library and how to manipulate and retrive the data according to specified statements

In [1]:
# importing the libraries
import pandas as pd
import numpy as np

#### 1.	Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

#### creating the rows for the DataFrame using dictionary

In [2]:
# Roll Number, Name, Gender, Marks1, Marks2, Marks3. --> these are the keys and their values are taken randomly
df=pd.DataFrame(
    {
             "Roll Number":[1,2,3,4,5,6,7,8,9,10],
             "Name":["balaji","kartheek","nisha","poorna","surya","ravi","venkat","thanuja","bantu","aarya"],
             "Gender":['M','M','F','M','M','M','M','F','M','M'],
             "Marks1":[98,99,56,78,56,48,97,89,69,100],
             "Marks2":[91,99,46,98,36,98,87,79,65,80],
             "Marks3":[88,91,89,71,88,99,100,68,87,90]
    })

In [3]:
df

   Roll Number      Name Gender  Marks1  Marks2  Marks3
0            1    balaji      M      98      91      88
1            2  kartheek      M      99      99      91
2            3     nisha      F      56      46      89
3            4    poorna      M      78      98      71
4            5     surya      M      56      36      88
5            6      ravi      M      48      98      99
6            7    venkat      M      97      87     100
7            8   thanuja      F      89      79      68
8            9     bantu      M      69      65      87
9           10     aarya      M     100      80      90

### Below is the required DataFrame

In [4]:
df.head()   # using head() function (to generate top 5 rows in the DataFrame)

   Roll Number      Name Gender  Marks1  Marks2  Marks3
0            1    balaji      M      98      91      88
1            2  kartheek      M      99      99      91
2            3     nisha      F      56      46      89
3            4    poorna      M      78      98      71
4            5     surya      M      56      36      88

In [5]:
df.tail()   # using tail() function to retrive the bottom 5 rows in the DataFrame

   Roll Number     Name Gender  Marks1  Marks2  Marks3
5            6     ravi      M      48      98      99
6            7   venkat      M      97      87     100
7            8  thanuja      F      89      79      68
8            9    bantu      M      69      65      87
9           10    aarya      M     100      80      90

In [6]:
df.info()    # description of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll Number  10 non-null     int64
 1   Name         10 non-null     object
 2   Gender       10 non-null     object
 3   Marks1       10 non-null     int64
 4   Marks2       10 non-null     int64
 5   Marks3       10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 608.0+ bytes

#### 2.	Create a new column with total marks

In [7]:
df["Total Marks"]=[277,289,191,247,180,245,284,236,221,270]

In [8]:
df

   Roll Number      Name Gender  Marks1  Marks2  Marks3  Total Marks
0            1    balaji      M      98      91      88          277
1            2  kartheek      M      99      99      91          289
2            3     nisha      F      56      46      89          191
3            4    poorna      M      78      98      71          247
4            5     surya      M      56      36      88          180
5            6      ravi      M      48      98      99          245
6            7    venkat      M      97      87     100          284
7            8   thanuja      F      89      79      68          236
8            9     bantu      M      69      65      87          221
9           10     aarya      M     100      80      90          270

In [9]:
lowest_marks1=df["Marks1"].min()    #.min() function used to get the minimum value in the particular attribute

In [10]:
print("Lowest marks in Marks1 of total students: ",lowest_marks1)

Lowest marks in Marks1 of total students:  48

### Lowest marks in Marks1 of total students:  48

#### 4.	Find the Highest marks in Marks2

In [11]:
highest_marks2=df["Marks2"].max()   #.max() function used to get the maximum value in the particular attribute

In [12]:
print("the Highest marks in Marks2 of total students",highest_marks2)

the Highest marks in Marks2 of total students 99

### the Highest marks in Marks2 of total students 99

#### 5.	Find the average marks in Marks3

In [13]:
average_marks3=df["Marks3"].mean()   #.mean() function used to get the average value in the particular attribute

In [14]:
print("the average marks in Marks3 of total students: ",average_marks3)

the average marks in Marks3 of total students:  87.1

#### 6.	Find student name with highest average

In [21]:
df['average_marks'] = df["Total Marks"]/3

In [22]:
df

,Roll Number,Name,Gender,Marks1,Marks2,Marks3,Total Marks,average_marks
0,1,balaji,M,98,91,88,277,92.333333
1,2,kartheek,M,99,99,91,289,96.333333
2,3,nisha,F,56,46,89,191,63.666667
3,4,poorna,M,78,98,71,247,82.333333
4,5,surya,M,56,36,88,180,60.000000
5,6,ravi,M,48,98,99,245,81.666667
6,7,venkat,M,97,87,100,284,94.666667
7,8,thanuja,F,89,79,68,236,78.666667
8,9,bantu,M,69,65,87,221,73.666667
9,10,aarya,M,100,80,90,270,90.000000

In [34]:
highest_average = df.average_marks.max()

In [35]:
highest_average

96.33333333333333

In [36]:
df

,Roll Number,Name,Gender,Marks1,Marks2,Marks3,Total Marks,average_marks
0,1,balaji,M,98,91,88,277,92.333333
1,2,kartheek,M,99,99,91,289,96.333333
2,3,nisha,F,56,46,89,191,63.666667
3,4,poorna,M,78,98,71,247,82.333333
4,5,surya,M,56,36,88,180,60.000000
5,6,ravi,M,48,98,99,245,81.666667
6,7,venkat,M,97,87,100,284,94.666667
7,8,thanuja,F,89,79,68,236,78.666667
8,9,bantu,M,69,65,87,221,73.666667
9,10,aarya,M,100,80,90,270,90.000000

In [37]:
high_scorer = df['Name'][1]

In [38]:
print("student Name with highest score: ",high_scorer)

student Name with highest score:  kartheek

#### 7.	Find how many students failed in Marks2 (<40)

In [39]:
failed_Marks2=df[df["Marks2"]<40]
failed_Marks2

,Roll Number,Name,Gender,Marks1,Marks2,Marks3,Total Marks,average_marks
4,5,surya,M,56,36,88,180,60.0

In [40]:
df[df["Marks2"]<40].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 4 to 4
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Roll Number    1 non-null      int64
 1   Name           1 non-null      object
 2   Gender         1 non-null      object
 3   Marks1         1 non-null      int64
 4   Marks2         1 non-null      int64
 5   Marks3         1 non-null      int64
 6   Total Marks    1 non-null      int64
 7   average_marks  1 non-null      float64
dtypes: float64(1), int64(5), object(2)
memory usage: 72.0+ bytes

In [41]:
# since ther are only 1 entries in the info of df
print("number of students failed in Marks2 is: ",failed_Marks2.shape[0]," and his name is: ",failed_Marks2["Name"])

number of students failed in Marks2 is:  1  and his name is:  4    surya
Name: Name, dtype: object

In [42]:
# df.shape[0] returns the number of rows in the df DataFrame